zyronjoshh-alt/RONWIFI_ESP8266/v0.2.1/http_server.cpp

#include "http_server.h"
#include "config.h"
#include "coinslot.h"
#include "rates.h"
#include "mikrotik_client.h"
#include <ESP8266WiFi.h>
#include <ESP8266WebServer.h>
#include <ArduinoJson.h>
#include <LittleFS.h>
#include <Updater.h>

static ESP8266WebServer server(80);

// Session state for current coin transaction
static String s_currentSessionId = "";
static String s_currentMac = "";
static String s_currentIp = "";
static uint32_t s_sessionStartMs = 0;

// ✅ FIX #4: Track window expiration for resume (set from main loop)
static uint32_t s_armWindowEndsMs = 0;

// ✅ FIX #3: Mutex to prevent auto-finalize / Done race
static volatile bool s_finalizeBusy = false;

// ✅ FIX #3: Cache last finalization result for late-arriving Done requests
struct FinalizeCache {
  String mac;
  uint32_t pesos;
  uint32_t minutes;
  uint32_t timestamp_ms;
  bool valid;
} s_finalizeCache = {"", 0, 0, 0, false};

// --- ANTI-ABUSE LEDGER ---
struct AbuseRecord {
  String mac;
  uint8_t strikes;
  uint32_t ban_expires_ms;
};
static AbuseRecord s_abuseLedger[10]; // Max 10 tracked offenders

static AbuseRecord* getLedgerEntry(const String& mac) {
  for (int i = 0; i < 10; i++) {
    if (s_abuseLedger[i].mac == mac) return &s_abuseLedger[i];
  }
  return nullptr;
}

// ---------- Helpers ----------
static void sendJson(int code, const String& body) {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(code, "application/json", body);
}

static void sendJsonOk(const String& dataJson) {
  sendJson(200, String("{\"ok\":true,\"data\":") + dataJson + "}");
}

static void sendJsonError(int code, const String& errCode, const String& msg) {
  String body = String("{\"ok\":false,\"error\":{\"code\":\"") + errCode +
                "\",\"message\":\"" + msg + "\"}}";
  sendJson(code, body);
}

static bool requireAdminAuth() {
  if (!server.authenticate(g_config.admin.username.c_str(), g_config.admin.password.c_str())) {
    server.requestAuthentication();
    return false;
  }
  return true;
}

// ---------- CORS preflight ----------
static void handleOptions() {
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "POST,GET,OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
  server.send(204);
}

// ✅ FIX #4: Called from main loop when coinslot enters ARMED state
void httpSetArmWindowEnds(uint32_t endsMs) {
  s_armWindowEndsMs = endsMs;
}

// ---------- PORTAL FALLBACK ENDPOINTS ----------
static void handlePing() {
  String body = String("{\"vendo_id\":") + g_config.vendo_id +
                ",\"vendo_name\":\"" + g_config.vendo_name + "\"" +
                ",\"uptime_s\":" + (millis() / 1000) +
                ",\"firmware\":\"" FIRMWARE_VERSION "\"}";
  sendJsonOk(body);
}

static void handleCoinStart() {
  StaticJsonDocument<256> doc;
  if (deserializeJson(doc, server.arg("plain"))) {
    sendJsonError(400, "bad_json", "Invalid JSON body");
    return;
  }

  String mac = doc["mac"] | "";
  String ip = doc["ip"] | "";
  if (mac.length() < 12 || ip.length() < 7) {
    sendJsonError(400, "bad_params", "mac and ip required");
    return;
  }
  mac.toUpperCase();

  // 1. CHECK THE LEDGER (Are they banned?)
  AbuseRecord* record = getLedgerEntry(mac);
  if (record && record->strikes >= g_config.coin.abuse_count) {
    if (millis() < record->ban_expires_ms) {
      uint32_t remainingMins = (record->ban_expires_ms - millis()) / 60000;
      sendJsonError(429, "banned", "Too many attempts. Please wait " + String(remainingMins + 1) + " minutes.");
      return;
    } else {
      // Ban expired, reset their strikes
      record->strikes = 0;
      record->ban_expires_ms = 0;
    }
  }

  CoinState cs = coinslotGetState();

  // 2. THE RESUME LOGIC
  if (cs == CS_ARMED || cs == CS_COUNTING || cs == CS_FINALIZING) {
    if (s_currentMac == mac) {
      // It's the same user! Just return the active session ID (Resume)
      // ✅ FIX #4: Calculate remaining seconds based on tracked window end
      uint32_t remaining_secs = (s_armWindowEndsMs > millis()) 
                               ? (s_armWindowEndsMs - millis()) / 1000 
                               : 0;
      String body = String("{\"session_id\":\"") + s_currentSessionId + "\",\"state\":\"" + 
                    (cs == CS_ARMED ? "armed" : "counting") + 
                    "\",\"window_seconds\":" + remaining_secs + "}";  // ✅ FIX #4: Return remaining, not full
      sendJsonOk(body);
      return;
    } else {
      // It's a different user trying to interrupt
      sendJsonError(409, "busy", "Coinslot busy");
      return;
    }
  }

  // 3. START NEW SESSION
  // ✅ FIX: Removed MikroTik pre-check - we'll check when creating user in /coin/done
  // This eliminates 1.5s blocking delay and "Coinslot Unavailable" errors on first try

  // 4. APPLY A STRIKE TO THE LEDGER
  if (!record) {
    // Find an empty slot
    for (int i = 0; i < 10; i++) {
      if (s_abuseLedger[i].mac == "") { record = &s_abuseLedger[i]; break; }
    }
    // If array is full, trigger Limbo state!
    if (!record) {
      sendJsonError(503, "limbo", "System preparing to restart. Please try again in 2 minutes.");
      return; 
    }
    record->mac = mac;
    record->strikes = 0;
  }
  
  record->strikes += 1;
  if (record->strikes >= g_config.coin.abuse_count) {
    record->ban_expires_ms = millis() + (g_config.coin.ban_duration_minutes * 60000UL);
  }

  // Initialize Session
  s_currentSessionId = String(millis(), HEX);
  s_currentMac = mac;
  s_currentIp = ip;
  s_sessionStartMs = millis();

  coinslotArm();

  String body = String("{\"session_id\":\"") + s_currentSessionId + 
                "\",\"state\":\"armed\"" +
                ",\"window_seconds\":" + g_config.coin.window_seconds + "}";
  sendJsonOk(body);
}

static String macWithColons(const String& noColons) {
  if (noColons.length() != 12) return noColons;
  String out = "";
  for (int i = 0; i < 12; i += 2) {
    out += noColons.substring(i, i + 2);
    if (i < 10) out += ":";
  }
  return out;
}

