zyronjoshh-alt/RONWIFI_ESP8266/v0.2.1/http_server.cpp
static void handleCoinDone() {
  StaticJsonDocument<256> doc;
  deserializeJson(doc, server.arg("plain"));

  String requestMac = doc["mac"] | "";
  requestMac.toUpperCase();

  // ✅ FIX #3: Check if auto-finalize is currently running
  if (s_finalizeBusy) {
    sendJsonError(503, "busy", "Finalization in progress, retry in 1 second");
    return;
  }

  // ✅ FIX #3: Check cache for late-arriving Done after auto-finalize completed
  if (coinslotGetState() == CS_IDLE) {
    if (s_finalizeCache.valid && 
        s_finalizeCache.mac == requestMac && 
        (millis() - s_finalizeCache.timestamp_ms) < 10000) {
      // Auto-finalize just handled this MAC <10s ago, return cached success
      String body = String("{\"pesos\":") + s_finalizeCache.pesos +
                    ",\"minutes\":" + s_finalizeCache.minutes +
                    ",\"username\":\"" + macWithColons(requestMac) + "\"" +
                    ",\"password\":\"" + macWithColons(requestMac) + "\"" +
                    ",\"status\":\"ok\"}";
      sendJsonOk(body);
      Serial.println(F("[done] Served cached result from auto-finalize"));
      return;
    }
    sendJsonError(400, "no_session", "No active session");
    return;
  }

  // ✅ FIX #3: Lock mutex
  s_finalizeBusy = true;

  coinslotSetState(CS_FINALIZING);
  uint32_t pulseCount = coinslotGetPulseCount();
  uint32_t pesos = pulseCount;  // 1 pulse = ₱1 (Allan coin slot programming)

if (pesos > 0) {
    // They paid! Clear their record completely.
    AbuseRecord* record = getLedgerEntry(s_currentMac);
    if (record) {
      record->mac = ""; // Free the slot
      record->strikes = 0;
    }
  }
  
  if (pesos == 0) {
    coinslotDisarm();
    s_finalizeBusy = false;  // ✅ FIX #3: Unlock
    sendJsonOk("{\"pesos\":0,\"minutes\":0,\"status\":\"cancelled\"}");
    s_currentSessionId = "";
    s_currentMac = "";  // ✅ Clear stale MAC
    s_currentIp = "";
    return;
  }

  uint32_t minutes = calculateMinutes(pesos);

  // Create/login MikroTik user
  bool ok = false;
  for (int i = 0; i < 3; i++) {
    if (mikrotikCreateAndLoginUser(s_currentMac,
                                    macWithColons(s_currentMac),
                                    s_currentIp,
                                    minutes)) {
      ok = true;
      break;
    }
    delay(500);
  }

  coinslotDisarm();

  if (!ok) {
    // Write to emergency log
    File f = LittleFS.open("/emergency.log", "a");
    if (f) {
      f.print(millis()); f.print("|");
      f.print(s_currentMac); f.print("|");
      f.print(s_currentIp); f.print("|");
      f.print(pesos); f.print("|");
      f.println(minutes);
      f.close();
    }
    s_finalizeBusy = false;  // ✅ FIX #3: Unlock
    sendJsonError(503, "mikrotik_failed", "Could not register user on MikroTik (logged locally)");
    s_currentSessionId = "";
    s_currentMac = "";
    s_currentIp = "";
    return;
  }

  // ✅ FIX #3: Cache this result before unlocking
  s_finalizeCache.mac = s_currentMac;
  s_finalizeCache.pesos = pesos;
  s_finalizeCache.minutes = minutes;
  s_finalizeCache.timestamp_ms = millis();
  s_finalizeCache.valid = true;

  String body = String("{\"pesos\":") + pesos +
                ",\"minutes\":" + minutes +
                ",\"username\":\"" + macWithColons(s_currentMac) + "\"" +
                ",\"password\":\"" + macWithColons(s_currentMac) + "\"" +
                ",\"status\":\"ok\"}";
  sendJsonOk(body);
  
  s_finalizeBusy = false;  // ✅ FIX #3: Unlock
  s_currentSessionId = "";
  s_currentMac = "";
  s_currentIp = "";
}

static void handleCoinCancel() {
  if (coinslotGetState() != CS_IDLE) {
    coinslotDisarm();
  }
  
  // Note: Strike is NOT removed on cancel (counts as abuse)
  // This prevents spam: repeated insert-cancel attempts
  
  // ✅ FIX: Clear ALL session variables
  s_currentSessionId = "";
  s_currentMac = "";
  s_currentIp = "";
  sendJsonOk("{\"status\":\"cancelled\"}");
}

static void handleStatus() {
  // URI: /status/{session_id}
  String uri = server.uri();
  int slash = uri.lastIndexOf('/');
  String sid = (slash >= 0) ? uri.substring(slash + 1) : "";
  (void)sid;

  uint32_t pulses = coinslotGetPulseCount();
  uint32_t minutes = calculateMinutes(pulses);
  uint32_t lastPulse = coinslotLastPulseMs();
  uint32_t inactiveMs = lastPulse ? (millis() - lastPulse) : 0;

  String body = String("{\"pesos\":") + pulses +
                ",\"minutes\":" + minutes +
                ",\"state\":\"" + (coinslotGetState() == CS_ARMED ? "armed" :
                                   coinslotGetState() == CS_COUNTING ? "counting" : "idle") + "\"" +
                ",\"inactive_ms\":" + inactiveMs + "}";
  sendJsonOk(body);
}

static void handleRates() {
  String body = "{\"tiers\":[";
  for (uint8_t i = 0; i < g_rates_count; i++) {
    if (i > 0) body += ",";
    body += "{\"label\":\"" + g_rates[i].label + "\"," +
            "\"pesos\":" + g_rates[i].pesos + "," +
            "\"minutes\":" + g_rates[i].minutes + "}";
  }
  body += "]}";
  sendJsonOk(body);
}

// ---------- ADMIN UI ----------
static const char ADMIN_HTML[] PROGMEM = R"HTML(
<!DOCTYPE html><html><head><meta charset="UTF-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>RONwifi Admin</title>
<style>
*{box-sizing:border-box}
body{font-family:system-ui,-apple-system,sans-serif;background:#f3f4f6;color:#1f2937;max-width:700px;margin:0 auto;padding:12px;font-size:14px}
h1{font-size:20px;margin:8px 0 4px;color:#2563eb}
.subtitle{color:#6b7280;font-size:12px;margin-bottom:16px}
h2{font-size:15px;margin:0 0 12px;color:#1f2937;padding-bottom:8px;border-bottom:1px solid #e5e7eb}
.card{background:#fff;border:1px solid #e5e7eb;border-radius:10px;padding:16px;margin-bottom:12px}
.row{display:flex;justify-content:space-between;padding:4px 0;font-size:13px}
.label{color:#6b7280}
.value{font-family:monospace;font-weight:600}
.status-ok{color:#10b981;font-weight:bold}
.status-err{color:#ef4444;font-weight:bold}
.status-warn{color:#f59e0b;font-weight:bold}

label.fld{display:block;margin:10px 0 0}
label.fld>span{display:block;font-size:12px;color:#6b7280;margin-bottom:4px;font-weight:600}
input[type=text],input[type=number],input[type=password],select,textarea{width:100%;padding:8px 10px;border:1px solid #d1d5db;border-radius:6px;font-size:14px;font-family:inherit;background:#fff;color:#1f2937}
input[type=checkbox]{width:auto;margin-right:6px;transform:scale(1.2)}
input:focus,select:focus,textarea:focus{outline:none;border-color:#2563eb;box-shadow:0 0 0 3px rgba(37,99,235,.15)}
textarea{font-family:'Consolas',monospace;font-size:12px;min-height:140px;resize:vertical}

