zyronjoshh-alt/RONWIFI_ESP8266/v0.2.1/http_server.cpp
.pw{position:relative}
.pw input{padding-right:48px}
.pw .pw-toggle{position:absolute;right:8px;top:8px;padding:4px 8px;background:#6b7280;color:#fff;border:none;border-radius:4px;cursor:pointer;font-size:11px;margin:0}

.grid2{display:grid;grid-template-columns:1fr 1fr;gap:8px}
.grid3{display:grid;grid-template-columns:1fr 1fr 1fr;gap:8px}

button{background:#2563eb;color:#fff;border:none;padding:10px 16px;border-radius:6px;cursor:pointer;font-size:14px;margin:4px 4px 4px 0;font-weight:600}
button:hover{background:#1d4ed8}
button.danger{background:#ef4444}
button.danger:hover{background:#dc2626}
button.secondary{background:#6b7280}
button.secondary:hover{background:#4b5563}
button.success{background:#10b981}

.save-bar{position:sticky;bottom:0;background:#fff;border-top:2px solid #2563eb;padding:12px;margin:16px -12px -12px;text-align:center;box-shadow:0 -4px 12px rgba(0,0,0,0.08)}
.save-bar button{padding:14px 32px;font-size:15px}

.msg{padding:10px;border-radius:6px;margin:8px 0;font-size:13px}
.msg-ok{background:#d1fae5;color:#065f46}
.msg-err{background:#fee2e2;color:#991b1b}
.msg-info{background:#dbeafe;color:#1e40af}

pre.diag{background:#0f172a;color:#e2e8f0;padding:12px;border-radius:6px;font-size:11px;line-height:1.5;overflow:auto;max-height:200px;white-space:pre-wrap;word-break:break-word}

.collapsible{cursor:pointer;user-select:none}
.collapsible::before{content:"▼ ";font-size:10px}
.collapsed.collapsible::before{content:"▶ "}
.collapsed + .card-body{display:none}
</style></head><body>

<h1>🤖 RONwifi Admin</h1>
<div class="subtitle">Vendo configuration — changes saved will trigger reboot</div>

<div id="msg"></div>

<!-- STATUS -->
<div class="card">
<h2>📊 Status</h2>
<div id="statusContent">Loading...</div>
</div>

<!-- DIAGNOSTICS -->
<div class="card">
<h2>🔧 Diagnostics</h2>
<button onclick="testOpen()">Test Open Coinslot (3s)</button>
<button onclick="pingMikrotik()">Ping MikroTik</button>
<button class="secondary" onclick="restart()">Restart ESP</button>
<button class="danger" onclick="factoryReset()">Factory Reset</button>
<div id="diagOut" style="margin-top:10px"></div>
<div class="card">
  <h2>🚀 Firmware Upgrade</h2>
  <div class="subtitle">Upload a compiled .bin file to update the system.</div>
  <input type="file" id="firmwareFile" accept=".bin" style="margin-bottom: 12px;">
  <div id="otaProgressContainer" style="display:none; width:100%; background:#e5e7eb; border-radius:6px; overflow:hidden; margin-bottom: 12px;">
    <div id="otaProgressBar" style="width:0%; height:8px; background:#2563eb; transition:width 0.2s;"></div>
  </div>
  <button type="button" class="success" onclick="startFirmwareUpdate()">Upload & Flash</button>
</div>
</div>

<!-- ====================================== FORM ====================================== -->
<form id="configForm" onsubmit="return false">

<!-- IDENTITY -->
<div class="card">
<h2>🏷️ Identity</h2>
<label class="fld"><span>Vendo ID</span><input type="number" name="vendo_id" min="1"></label>
<label class="fld"><span>Vendo Name</span><input type="text" name="vendo_name" maxlength="40"></label>
</div>

<!-- NETWORK -->
<div class="card">
<h2>🌐 Network</h2>
<label class="fld"><span>Mode</span>
<select name="network_mode" onchange="toggleStaticFields()">
<option value="static">Static IP</option>
<option value="dhcp">DHCP (auto)</option>
</select></label>
<div id="staticFields">
<div class="grid2">
<label class="fld"><span>Static IP</span><input type="text" name="network_static_ip" placeholder="10.0.11.7"></label>
<label class="fld"><span>Gateway</span><input type="text" name="network_gateway" placeholder="10.0.11.1"></label>
</div>
<div class="grid2">
<label class="fld"><span>Netmask</span><input type="text" name="network_netmask" value="255.255.255.0"></label>
<label class="fld"><span>DNS</span><input type="text" name="network_dns" placeholder="10.0.11.1"></label>
</div>
</div>
</div>

<!-- WIFI -->
<div class="card">
<h2>📶 WiFi</h2>
<label class="fld"><span>SSID</span><input type="text" name="wifi_ssid" maxlength="32"></label>
<label class="fld"><span>Password</span>
<div class="pw"><input type="password" name="wifi_password" maxlength="63">
<button type="button" class="pw-toggle" onclick="togglePw(this)">SHOW</button></div></label>
</div>

<!-- MQTT -->
<div class="card">
<h2 class="collapsible" onclick="toggleCollapse(this)">📡 MQTT (unused in v0)</h2>
<div class="card-body">
<div class="grid2">
<label class="fld"><span>Host</span><input type="text" name="mqtt_host" placeholder="10.99.0.8"></label>
<label class="fld"><span>Port</span><input type="number" name="mqtt_port" value="1883"></label>
</div>
<label class="fld"><span>Username</span><input type="text" name="mqtt_username"></label>
<label class="fld"><span>Password</span>
<div class="pw"><input type="password" name="mqtt_password">
<button type="button" class="pw-toggle" onclick="togglePw(this)">SHOW</button></div></label>
<label class="fld"><span>Keepalive (seconds)</span><input type="number" name="mqtt_keepalive_seconds" value="60"></label>
</div>
</div>

<!-- MIKROTIK -->
<div class="card">
<h2>🔌 MikroTik</h2>
<div class="grid2">
<label class="fld"><span>Host (gateway IP)</span><input type="text" name="mikrotik_host" placeholder="10.0.11.1"></label>
<label class="fld"><span>Port</span><input type="number" name="mikrotik_port" value="80"></label>
</div>
<label class="fld"><span>Username</span><input type="text" name="mikrotik_username" placeholder="vendo-1-api"></label>
<label class="fld"><span>Password</span>
<div class="pw"><input type="password" name="mikrotik_password">
<button type="button" class="pw-toggle" onclick="togglePw(this)">SHOW</button></div></label>
<div class="msg msg-info" style="margin-top:10px;font-size:12px">
Make sure <code>/ip service enable www</code> is set on MikroTik and the API user exists. Use "Ping MikroTik" above to test.
</div>
</div>

<!-- ADMIN -->
<div class="card">
<h2>👤 Admin (this page)</h2>
<label class="fld"><span>Username</span><input type="text" name="admin_username"></label>
<label class="fld"><span>Password</span>
<div class="pw"><input type="password" name="admin_password">
<button type="button" class="pw-toggle" onclick="togglePw(this)">SHOW</button></div></label>
</div>

<!-- COIN SETTINGS -->
<div class="card">
<h2>🪙 Coin Settings</h2>
<div class="grid3">
<label class="fld"><span>Window (seconds)</span><input type="number" name="coin_window_seconds" min="10" max="300"></label>
<label class="fld"><span>Points Rate</span><input type="number" name="coin_points_rate" step="0.01" min="0" max="1"></label>
<label class="fld"><span>Debounce (ms)</span><input type="number" name="coin_debounce_ms" min="5" max="500"></label>
</div>
</div>

