zyronjoshh-alt/RONWIFI_ESP8266/v0.2.1/http_server.cpp
/* ============ DIAGNOSTICS ============ */
function testOpen(){
  $('diagOut').innerHTML='<div class="msg msg-info">Opening coinslot for 3s...</div>';
  api('POST','/admin/test_open',{duration_ms:3000},function(s,r){
    $('diagOut').innerHTML='<div class="msg msg-ok">✓ Coinslot opened 3s (listen for click)</div>';
  });
}

function pingMikrotik(){
  $('diagOut').innerHTML='<div class="msg msg-info">Pinging MikroTik...</div>';
  api('POST','/admin/ping_mikrotik',null,function(s,r){
    var d=r.data||r.error||{};
    var html='';
    if(r.ok){
      html+='<div class="msg msg-ok">✓ MikroTik reachable! (HTTP '+(d.http_code||200)+')</div>';
      if(d.response)html+='<pre class="diag">'+escHtml(d.response)+'</pre>';
    }else{
      html+='<div class="msg msg-err">✗ MikroTik unreachable</div>';
      html+='<pre class="diag">';
      html+='URL: '+escHtml(d.url||'?')+'\n';
      html+='HTTP Code: '+(d.http_code||'n/a')+'\n';
      html+='Error: '+escHtml(d.error||d.message||'unknown')+'\n';
      if(d.response)html+='Response:\n'+escHtml(d.response);
      html+='</pre>';
      html+='<div class="msg msg-info" style="font-size:12px">Check: /ip service enable www on MikroTik. Verify REST API user exists with full or rest-api group. See serial monitor for details.</div>';
    }
    $('diagOut').innerHTML=html;
  });
}

function escHtml(s){return String(s).replace(/[&<>"']/g,function(c){return{'&':'&amp;','<':'&lt;','>':'&gt;','"':'&quot;',"'":'&#39;'}[c]})}

function factoryReset(){
  if(!confirm('ERASE ALL config files?\n\nESP will reboot into AP mode.\nYou will need to reconfigure from scratch.'))return;
  if(!confirm('Really? This cannot be undone.'))return;
  api('POST','/admin/factory_reset',null,function(){msg('Erased. Rebooting to AP mode...','info')});
}

function restart(){
  if(!confirm('Restart ESP now?'))return;
  api('POST','/admin/restart',null,function(){msg('Rebooting...','info')});
}

/* ============ OTA UPDATE ============ */
function startFirmwareUpdate() {
  var fileInput = $('firmwareFile');
  if (!fileInput.files.length) {
    msg('Please select a .bin file first.', 'err');
    return;
  }
  
  if(!confirm('Flash new firmware? Do NOT disconnect power during this process.')) return;

  var file = fileInput.files[0];
  var formData = new FormData();
  formData.append("update", file, file.name);

  $('otaProgressContainer').style.display = 'block';
  msg('Uploading firmware. Please wait...', 'info');

  var x = new XMLHttpRequest();
  x.open('POST', '/admin/update', true);
  
  x.upload.addEventListener("progress", function(evt) {
    if (evt.lengthComputable) {
      var percentComplete = (evt.loaded / evt.total) * 100;
      $('otaProgressBar').style.width = percentComplete + '%';
    }
  }, false);

  x.onreadystatechange = function() {
    if (x.readyState === 4) {
      if (x.status >= 200 && x.status < 300) {
        msg('✓ Firmware flashed! Vendo is rebooting...', 'ok');
        setTimeout(function(){ window.location.reload(); }, 15000);
      } else {
        msg('Firmware update failed. Check serial logs.', 'err');
        $('otaProgressContainer').style.display = 'none';
      }
    }
  };
  
  x.send(formData);
}

/* ============ BOOT ============ */
loadStatus();loadConfig();loadRates();
setInterval(loadStatus,3000);
</script></body></html>
)HTML";

static void handleAdmin() {
  if (!requireAdminAuth()) return;
  server.send_P(200, "text/html", ADMIN_HTML);
}

static void handleAdminStatus() {
  if (!requireAdminAuth()) return;
  String body = String("{") +
    "\"vendo_id\":" + g_config.vendo_id + "," +
    "\"vendo_name\":\"" + g_config.vendo_name + "\"," +
    "\"firmware\":\"" FIRMWARE_VERSION "\"," +
    "\"uptime_s\":" + (millis() / 1000) + "," +
    "\"free_heap\":" + ESP.getFreeHeap() + "," +
    "\"rssi\":" + WiFi.RSSI() + "," +
    "\"ip\":\"" + WiFi.localIP().toString() + "\"," +
    "\"state\":\"" + (coinslotGetState() == CS_ARMED ? "armed" :
                     coinslotGetState() == CS_COUNTING ? "counting" :
                     coinslotGetState() == CS_FINALIZING ? "finalizing" : "idle") + "\"," +
    "\"pulse_count\":" + coinslotGetPulseCount() +
  "}";
  sendJsonOk(body);
}

static void handleAdminConfig() {
  if (!requireAdminAuth()) return;
  server.sendHeader("Access-Control-Allow-Origin", "*");
  String masked = configToJson();
  server.send(200, "application/json",
              String("{\"ok\":true,\"data\":") + masked + "}");
}

static void handleAdminConfigRaw() {
  if (!requireAdminAuth()) return;
  server.sendHeader("Access-Control-Allow-Origin", "*");
  String full = configToJsonFull();
  server.send(200, "application/json",
              String("{\"ok\":true,\"data\":") + full + "}");
}

static void handleAdminConfigSave() {
  if (!requireAdminAuth()) return;
  String body = server.arg("plain");
  if (body.length() < 50) {
    sendJsonError(400, "empty", "Config body empty or too small");
    return;
  }
  if (!configSave(body)) {
    sendJsonError(400, "invalid", "Config JSON invalid or missing required fields");
    return;
  }
  sendJsonOk("{\"status\":\"saved\"}");
  // Caller is expected to hit /admin/restart next; we do not auto-reboot here
  // so the success response can reach the browser first.
}

static void handleAdminRatesSave() {
  if (!requireAdminAuth()) return;
  String body = server.arg("plain");
  if (ratesSave(body)) sendJsonOk("{\"status\":\"saved\"}");
  else sendJsonError(400, "invalid", "Could not save rates");
}

static void handleAdminTestOpen() {
  if (!requireAdminAuth()) return;
  StaticJsonDocument<128> doc;
  deserializeJson(doc, server.arg("plain"));
  uint32_t dur = doc["duration_ms"] | 2000;
  coinslotTestOpen(dur);
  sendJsonOk("{\"status\":\"done\"}");
}

static void handleAdminPingMikrotik() {
  if (!requireAdminAuth()) return;
  MikrotikPingResult r = mikrotikPingDetailed();

  // Build JSON with diagnostic info (escape special chars in response/error)
  StaticJsonDocument<1024> doc;
  doc["ok"] = r.ok;
  JsonObject data = doc.createNestedObject(r.ok ? "data" : "error");
  data["http_code"] = r.http_code;
  data["url"] = r.url;
  data["error"] = r.error;
  data["response"] = r.response;
  if (!r.ok) {
    data["code"] = "mikrotik_failed";
    data["message"] = r.error;
  }

  String out;
  serializeJson(doc, out);
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.send(r.ok ? 200 : 503, "application/json", out);
}

static void handleAdminFactoryReset() {
  if (!requireAdminAuth()) return;
  LittleFS.remove("/config.json");
  LittleFS.remove("/config.backup.json");
  LittleFS.remove("/rates.json");
  LittleFS.remove("/emergency.log");
  sendJsonOk("{\"status\":\"reset\"}");
  delay(500);
  ESP.restart();
}

static void handleAdminRestart() {
  if (!requireAdminAuth()) return;
  sendJsonOk("{\"status\":\"restarting\"}");
  delay(500);
  ESP.restart();
}

static void handleNotFound() {
  sendJsonError(404, "not_found", "Endpoint not found");
}

void httpAutoFinalizeSession() {
  if (coinslotGetState() == CS_IDLE) return;
  
  // ✅ FIX #3: Skip if user's Done is currently handling it
  if (s_finalizeBusy) {
    Serial.println(F("[auto] Skipping (Done in progress)"));
    return;
  }

  Serial.println(F("[auto] Timeout reached, auto-finalizing session..."));
  
