zyronjoshh-alt/RONWIFI_ESP8266/v0.2.1/http_server.cpp
  // ✅ FIX #3: Lock mutex
  s_finalizeBusy = true;
  
  coinslotSetState(CS_FINALIZING);
  uint32_t pesos = coinslotGetPulseCount();
  
  if (pesos == 0) {
    // Spammer. The strike is already on their record from handleCoinStart.
    Serial.println(F("[auto] 0 pesos inserted. Disarming."));
    coinslotDisarm();
    s_finalizeBusy = false;  // ✅ FIX #3: Unlock
    s_currentSessionId = "";
    s_currentMac = "";
    s_currentIp = "";
    return;
  }

  // They walked away but left money!
  uint32_t minutes = calculateMinutes(pesos);
  
  // They bought time, so clear their strike!
  AbuseRecord* record = getLedgerEntry(s_currentMac);
  if (record) record->mac = ""; 

  mikrotikCreateAndLoginUser(s_currentMac, macWithColons(s_currentMac), s_currentIp, minutes);
  
  // ✅ FIX #3: Cache this result for late-arriving Done requests
  s_finalizeCache.mac = s_currentMac;
  s_finalizeCache.pesos = pesos;
  s_finalizeCache.minutes = minutes;
  s_finalizeCache.timestamp_ms = millis();
  s_finalizeCache.valid = true;
  
  coinslotDisarm();
  s_finalizeBusy = false;  // ✅ FIX #3: Unlock
  s_currentSessionId = "";
  s_currentMac = "";
  s_currentIp = "";
  Serial.println(F("[auto] Granted time to abandoned session."));
}

// ---------- Init ----------
void httpServerInit() {
  server.on("/ping", HTTP_GET, handlePing);
  server.on("/ping", HTTP_OPTIONS, handleOptions);

  server.on("/coin/start", HTTP_POST, handleCoinStart);
  server.on("/coin/start", HTTP_OPTIONS, handleOptions);

  server.on("/coin/done", HTTP_POST, handleCoinDone);
  server.on("/coin/done", HTTP_OPTIONS, handleOptions);

  server.on("/coin/cancel", HTTP_POST, handleCoinCancel);
  server.on("/coin/cancel", HTTP_OPTIONS, handleOptions);

  server.on("/rates", HTTP_GET, handleRates);
  server.on("/rates", HTTP_OPTIONS, handleOptions);

  // /status/{session_id} - match any path under /status/
  server.onNotFound([]() {
    String uri = server.uri();
    if (uri.startsWith("/status/")) {
      handleStatus();
      return;
    }
    handleNotFound();
  });

  // Admin
  server.on("/admin", HTTP_GET, handleAdmin);
  server.on("/admin/status", HTTP_GET, handleAdminStatus);
  server.on("/admin/config", HTTP_GET, handleAdminConfig);
  server.on("/admin/config", HTTP_POST, handleAdminConfigSave);
  server.on("/admin/config_raw", HTTP_GET, handleAdminConfigRaw);
  server.on("/admin/rates", HTTP_POST, handleAdminRatesSave);
  server.on("/admin/test_open", HTTP_POST, handleAdminTestOpen);
  server.on("/admin/ping_mikrotik", HTTP_POST, handleAdminPingMikrotik);
  server.on("/admin/factory_reset", HTTP_POST, handleAdminFactoryReset);
  server.on("/admin/restart", HTTP_POST, handleAdminRestart);

// ---------- Firmware OTA Update Endpoint ----------
  server.on("/admin/update", HTTP_POST, 
    []() {
      // 1. This runs when the upload is completely finished
      server.sendHeader("Connection", "close");
      server.send(200, "application/json", Update.hasError() ? "{\"ok\":false}" : "{\"ok\":true}");
      delay(1000);
      ESP.restart();
    }, 
    []() {
      // 2. This runs continuously as the file chunks stream in
      HTTPUpload& upload = server.upload();
      
      if (upload.status == UPLOAD_FILE_START) {
        Serial.printf("[OTA] Update Start: %s\n", upload.filename.c_str());
        // Calculate safe space to avoid overwriting LittleFS
        uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
        if (!Update.begin(maxSketchSpace, U_FLASH)) { // U_FLASH targets firmware
          Update.printError(Serial);
        }
      } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
          Update.printError(Serial);
        }
      } else if (upload.status == UPLOAD_FILE_END) {
        if (Update.end(true)) { // true = empty the buffers
          Serial.printf("[OTA] Update Success: %u bytes\n", upload.totalSize);
        } else {
          Update.printError(Serial);
        }
      }
    }
  );

  server.begin();
  Serial.println(F("[http] server started on :80"));
}

void httpServerLoop() {
  server.handleClient();
}

bool shouldArmCoinslot() { return false; }
void clearArmRequest() {}

